export type Code =
  | 'SYSTEM-100000'
  | 'AUTH-100040'
  | 'AUTH-100041'
  | 'AUTH-100042'
  | 'AUTH-100043'
  | 'AUTH-100047'
  | 'AUTH-100048'
  | 'AUTH-100049'
  | 'AUTH-100053'
  | 'BUCKET-100000'
  | 'MODEL-100000'

export enum CODE_OPTIONS {
  'SYSTEM-100000' = '连接成功',
  'AUTH-100040' = '登录失效，请重新登录',
  'AUTH-100041' = '密码被修改，即将返回到登录界面',
  'AUTH-100042' = '用户被禁用，即将返回到登录界面',
  'AUTH-100043' = '该用户关联的角色被修改，权限发生变化，即将返回到登录界面',
  'AUTH-100047' = '权限发生变化，即将返回到登录界面',
  'AUTH-100048' = '异地登录，即将返回到登录界面',
  'AUTH-100049' = '用户token过期，即将返回到登录界面',
  'AUTH-100053' = '你的手机号发生变化，请重新登录',
  'BUCKET-100000' = '数据集数据准备中',
  'MODEL-100000' = '模型库数据准备中'
}

// 需要清空任务列表的code
export const CODE_CLEAR_TASK = [
  'AUTH-100040',
  'AUTH-100041',
  'AUTH-100042',
  'AUTH-100043',
  'AUTH-100047',
  'AUTH-100048',
  'AUTH-100049',
  'AUTH-100053'
]
